Revit 2027 API
BuiltInFailures.RoomFailures.InvisibleRoomBoundElemement Property
 [Room] Bounding element is invisible in current view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvisibleRoomBoundElemement { get; }
Public Shared ReadOnly Property InvisibleRoomBoundElemement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvisibleRoomBoundElemement {
	FailureDefinitionId^ get ();
}
static member InvisibleRoomBoundElemement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace